Dmivaka/STM32H7-ETH-LWIP/Src/main.c
  udp_client_connect();
  udp_lcm_connect();
  
  HAL_TIM_Base_Start_IT(&htim7); // enable microseconds timesource
  HAL_TIM_Base_Start_IT(&htim1);
  
  // Filter for messages from master to this dedicated device. 
  FDCAN_FilterTypeDef sFilterConfig;  
  sFilterConfig.IdType = FDCAN_EXTENDED_ID;
  sFilterConfig.FilterIndex = 0;
  sFilterConfig.FilterType = FDCAN_FILTER_RANGE;
  sFilterConfig.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
  sFilterConfig.FilterID1 = 0x0;
  sFilterConfig.FilterID2 = 0x1FFFFFFF;  
  
  // iterate over three CAN bus handles and enable their parameters
  for( int i = 0; i < 3; i++)
  {
    // choose one FDCAN Handle from the three available
    FDCAN_HandleTypeDef * FDCAN_Handle = FDCAN_Handles_Map[i];
    
    if( FDCAN_Handle != NULL )
    {
      // Configure CAN frames filtering 
      if( HAL_FDCAN_ConfigFilter(FDCAN_Handle, &sFilterConfig) != HAL_OK ){ Error_Handler(); }  
      
      // Configure global filter: Filter all remote frames with STD and EXT ID. Reject non matching frames with STD ID and EXT ID
      if( HAL_FDCAN_ConfigGlobalFilter(FDCAN_Handle, FDCAN_REJECT, FDCAN_REJECT, FDCAN_FILTER_REMOTE, FDCAN_FILTER_REMOTE) != HAL_OK ){ Error_Handler(); }
      
      // Configure and enable Tx Delay Compensation, required for BRS mode.
      if( HAL_FDCAN_ConfigTxDelayCompensation(FDCAN_Handle, 5, 0) != HAL_OK){ Error_Handler(); }
      if( HAL_FDCAN_EnableTxDelayCompensation(FDCAN_Handle) != HAL_OK){ Error_Handler(); }
      
      // Activate Rx FIFO 0 new message notification
      //if( HAL_FDCAN_ActivateNotification(FDCAN_Handle, FDCAN_IT_RX_FIFO0_NEW_MESSAGE, 0) != HAL_OK ){ Error_Handler(); }      
      
      // Activate TX FIFO empty notification
      if( HAL_FDCAN_ActivateNotification( FDCAN_Handle, 
                                          FDCAN_IT_TX_FIFO_EMPTY, 
                                          FDCAN_TX_BUFFER0 | FDCAN_TX_BUFFER1 | FDCAN_TX_BUFFER2) != HAL_OK )
                                          { Error_Handler(); }

      // Start FDCAN periphery
      if( HAL_FDCAN_Start(FDCAN_Handle) != HAL_OK ){ Error_Handler(); }
    }
  }
  ///////////////////////////////////////////////////////////////////////////

  // enable the companion chip
  LL_GPIO_SetOutputPin(GPIOE, LL_GPIO_PIN_5);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  uint32_t timestamp = HAL_GetTick();
  uint64_t uavcan_request_timestamp = micros();
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    if( HAL_GetTick() > timestamp )
    {
      //LL_GPIO_SetOutputPin(GPIOE, LL_GPIO_PIN_4);
      //HAL_SPI_Transmit_DMA(&hspi4, SPI_TX_buf, 512);
      
      //conke(); // debug transmition of sample data
      timestamp += 100;
      
      if( UDP_TX_level > 0 )
      {
        UDP_TX_send( &UDP_TX_level );
      }
    }
    
    MX_LWIP_Process();

    if( micros() > uavcan_request_timestamp )
    {
      UAVCAN_request();
      
      uavcan_request_timestamp += 1000;
    }    
    
    if( LCM_rx_flag )
    {
      UAVCAN_send();

      LCM_rx_flag = 0;
    }
    
    if( LCM_tx_flag )
    {
      conke();
      LCM_tx_flag = 0;
    }

    /// retrieve and process frames from the on-chip FDCAN peripherals
    for( int i = 0; i < 3; i++)
    {
      HAL_FDCAN_GetErrorCounters(FDCAN_Handles_Map[i], &can_error_count[i]);
      HAL_FDCAN_GetProtocolStatus(FDCAN_Handles_Map[i], &can_protocol_stat[i]);
      
      // ? https://community.st.com/t5/stm32-mcu-products/stm32h7-fdcan-has-lost-the-automatic-bus-off-recovery-mechanism/td-p/187400
      if( can_protocol_stat[i].BusOff )
      {
        CLEAR_BIT(FDCAN_Handles_Map[i]->Instance->CCCR, FDCAN_CCCR_INIT);
      }

      while( HAL_FDCAN_GetRxFifoFillLevel(FDCAN_Handles_Map[i], FDCAN_RX_FIFO0) > 0 )
      {
        FDCAN_RxHeaderTypeDef Header;
        uint8_t RxData[64];
    
        if (HAL_FDCAN_GetRxMessage(FDCAN_Handles_Map[i], FDCAN_RX_FIFO0, &Header, RxData) != HAL_OK){ Error_Handler(); }
        
        // turn LED to indicate received message
        indicators_state[i] = 1;

        // separate frames into the LCM and UAVCAN -related buffers
        if( !parse_canard_frame( Header.Identifier, LengthDecoder(Header.DataLength), RxData ) )
        {
          // the canard frames filter said it is not the canard frame and returned 0.
          // we have to put this frame untouched into UDP TX chain
          uint8_t local_buffer[69] = {0};
          uint8_t msg_len = serialize_can_frame(  i, 
                                                  Header.Identifier, 
                                                  LengthDecoder(Header.DataLength), 
                                                  RxData, 
                                                  local_buffer);
          if( UDP_TX_level + msg_len > UDP_TX_size )
          {
            UDP_TX_send( &UDP_TX_level );
          }

          pbuf_take_at( UDP_TX_buf, local_buffer, msg_len, UDP_TX_level);
          UDP_TX_level += msg_len;
        }
      }
    }
    
    /// processing of the serialized FDCAN frames from companion chip (SPI RX chain)
    while( SPI_RX_buf.bytes_written > 0 )
    {
      uint8_t local_buffer[69] = {0};
      uint8_t msg_len = 0;
      
      uint32_t primask_bit = __get_PRIMASK();  // backup PRIMASK bit
      __disable_irq();                  // Disable all interrupts by setting PRIMASK bit on Cortex
      
        msg_len = SPI_RX_buf.buffer_body[SPI_RX_buf.head]; // get the frame length, it's located at the beginning of new frame in the buffer
        if( msg_len > SPI_RX_buf.bytes_written )
        {
          // buffer is corrupted
          Error_Handler();
        }
        read_buffer(&SPI_RX_buf, local_buffer, msg_len);
        
      __set_PRIMASK(primask_bit);     // Restore PRIMASK bit

      uint32_t identifier;
      size_t size;
      uint8_t RxData[69];
      deserialize_can_frame( NULL, &identifier, &size, RxData, local_buffer);
      
      // separate frames into the LCM and UAVCAN -related buffers
      if( !parse_canard_frame( identifier, size, RxData ) )
      {
        // the canard frames filter said it is not the canard frame and returned 0.
        // we have to put this frame untouched into UDP TX chain
        if( UDP_TX_level + msg_len > UDP_TX_size )
        {
          UDP_TX_send( &UDP_TX_level );
        }

        pbuf_take_at( UDP_TX_buf, local_buffer, msg_len, UDP_TX_level);
        UDP_TX_level += msg_len;
      }

